shimjaeyeong/H-TEC/Micrium/Software/EvalBoards/ST/STM3210B-EVAL/IAR/OS-Probe/app_sy.c
/*
 *********************************************************************************************************
 *                                            checkTask()
 *
 * Description : Check dot-matrix, piezo, motor.
 *
 * Argument(s) : p
 *
 * Return(s)   : none.
 *
 * Caller(s)   : This is a task.
 *
 * Note(s)     : none.
 *********************************************************************************************************
 */
// dot-matrix, piezo, motor를 1초 후 정지하도록 하는 Task
static void checkTask(void *p)
{
	CPU_INT08U err;
	int isStop = 0;
	while (DEF_TRUE)
	{
		if (count != 0)
		{
			OSSemPend(sem, 0, &err);
			if (count > TIME_COUNT)
			{
				isStop = 1; // Use flag / Don't do a lot of work in sem
				count = 0;	// init time counter
			}
			count++;
			OSSemPost(sem);

			// STOP: Do out of sem
			if (isStop == 1)
			{
				stopAll();
				isStop = 0;
			}
		}

		OSTimeDlyHMSM(0, 0, 0, DELAY_TIME); // To run other tasks
	}
}

// Stop all
static void stopAll()
{
	// dot-matrix

	// piezo
	GPIO_ResetBits(GPIOB, GPIO_Pin_8);
	// motor
	for (int i = TIM2->CCR1; i > 1500; i -= 2) // 2300 -> 1500
	{
		TIM2->CCR1 = i;
	}
}
/*
 *********************************************************************************************************
 *                                          DispScr_SignOn()
 *
 * Description : Display uC/OS-II system information on the LCD.
 *
 * Argument(s) : none.
 *
 * Return(s)   : none.
 *
 * Caller(s)   : TaskUserIF().
 *
 * Note(s)     : none.
 *********************************************************************************************************
 */

static void DispScr_SignOn(void)
{
}

/*
 *********************************************************************************************************
 *                                          DispScr_SignOn()
 *
 * Description : Display uC/OS-II system information on the LCD.
 *
 * Argument(s) : none.
 *
 * Return(s)   : none.
 *
 * Caller(s)   : TaskUserIF().
 *
 * Note(s)     : none.
 *********************************************************************************************************
 */

static void DispScr_TaskNames(void)
{
}

/*
 *********************************************************************************************************
 *                                             InitProbe()
 *
 * Description : Initialize uC/Probe target code.
 *
 * Argument(s) : none.
 *
 * Return(s)   : none.
 *
 * Caller(s)   : TaskStart().
 *
 * Note(s)     : none.
 *********************************************************************************************************
 */

#if ((PROBE_COM_EN == DEF_ENABLED) || \
	 (OS_PROBE_EN == DEF_ENABLED))
static void InitProbe(void)
{
#if (OS_PROBE_EN == DEF_ENABLED)
	(void)ProbeCounts;
	(void)ProbeB1;

#if ((PROBE_COM_EN == DEF_ENABLED) && \
	 (PROBE_COM_STAT_EN == DEF_ENABLED))
	(void)ProbeComRxPktSpd;
	(void)ProbeComTxPktSpd;
	(void)ProbeComTxSymSpd;
	(void)ProbeComTxSymByteSpd;
#endif

	OSProbe_Init();
	OSProbe_SetCallback(ProbeCallback);
	OSProbe_SetDelay(250);
#endif

#if (PROBE_COM_EN == DEF_ENABLED)
	ProbeCom_Init(); /* Initialize the uC/Probe communications module.       */
#endif
}
#endif

/*
 *********************************************************************************************************
 *                                         AppProbeCallback()
 *
 * Description : uC/Probe OS plugin callback.
 *
 * Argument(s) : none.
 *
 * Return(s)   : none.
 *
 * Caller(s)   : uC/Probe OS plugin task.
 *
 * Note(s)     : none.
 *********************************************************************************************************
 */

#if (OS_PROBE_EN == DEF_ENABLED)
static void ProbeCallback(void)
{
#if ((PROBE_COM_EN == DEF_ENABLED) && \
	 (PROBE_COM_STAT_EN == DEF_ENABLED))
	CPU_INT32U ctr_curr;
	CPU_INT32U rxpkt_curr;
	CPU_INT32U txpkt_curr;
	CPU_INT32U sym_curr;
	CPU_INT32U symbyte_curr;
#endif

	ProbeCounts++;

	ProbeB1 = BSP_PB_GetStatus(1);

#if ((PROBE_COM_EN == DEF_ENABLED) && \
	 (PROBE_COM_STAT_EN == DEF_ENABLED))
	ctr_curr = OSTime;
	rxpkt_curr = ProbeCom_RxPktCtr;
	txpkt_curr = ProbeCom_TxPktCtr;
	sym_curr = ProbeCom_TxSymCtr;
	symbyte_curr = ProbeCom_TxSymByteCtr;

	if ((ctr_curr - ProbeComCtrLast) >= OS_TICKS_PER_SEC)
	{
		ProbeComRxPktSpd = ((CPU_FP32)(rxpkt_curr - ProbeComRxPktLast) / (ctr_curr - ProbeComCtrLast)) * OS_TICKS_PER_SEC;
		ProbeComTxPktSpd = ((CPU_FP32)(txpkt_curr - ProbeComTxPktLast) / (ctr_curr - ProbeComCtrLast)) * OS_TICKS_PER_SEC;
		ProbeComTxSymSpd = ((CPU_FP32)(sym_curr - ProbeComTxSymLast) / (ctr_curr - ProbeComCtrLast)) * OS_TICKS_PER_SEC;
		ProbeComTxSymByteSpd = ((CPU_FP32)(symbyte_curr - ProbeComTxSymByteLast) / (ctr_curr - ProbeComCtrLast)) * OS_TICKS_PER_SEC;

		ProbeComCtrLast = ctr_curr;
		ProbeComRxPktLast = rxpkt_curr;
		ProbeComTxPktLast = txpkt_curr;
		ProbeComTxSymLast = sym_curr;
		ProbeComTxSymByteLast = symbyte_curr;
	}
#endif
}
#endif

/*
 *********************************************************************************************************
 *                                      FormatDec()
 *
 * Description : Convert a decimal value to ASCII (without leading zeros).
 *
 * Argument(s) : pstr            Pointer to the destination ASCII string.
 *
 *               value           Value to convert (assumes an unsigned value).
 *
 *               digits          The desired number of digits.
 *
 * Return(s)   : none.
 *
 * Caller(s)   : various.
 *
 * Note(s)     : none.
 *********************************************************************************************************
 */

/*
 *********************************************************************************************************
 *********************************************************************************************************
 *                                          uC/OS-II APP HOOKS
 *********************************************************************************************************
 *********************************************************************************************************
 */

#if (OS_HOOKS_EN > 0)
/*
 *********************************************************************************************************
 *                                      TASK CREATION HOOK (APPLICATION)
 *
 * Description : This function is cal when a task is created.
 *
 * Argument(s) : ptcb   is a pointer to the task control block of the task being created.
 *
 * Note(s)     : (1) Interrupts are disabled during this call.
 *********************************************************************************************************
 */

void TaskCreateHook(OS_TCB *ptcb)
{
#if ((OS_PROBE_EN == DEF_ENABLED) && \
	 (OS_PROBE_HOOKS_EN == DEF_ENABLED))
	OSProbe_TaskCreateHook(ptcb);
#endif
}

